pascal-3.1/tutorials/surfaceTracking/interTrackMHDmagFoam/slanting2D/constant/extrudeProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

geo_dy 0.00125;

// ************************************************************************* //

extrudeModel    linearNormal;

linearNormalCoeffs
{
    thickness   $geo_dy;
}

nLayers         1;

constructFrom   patch;

sourceCase      ".";

sourcePatch     "front";

flipNormals     off;

mergeFaces      off;

// ************************************************************************* //